# read the verilog file
read_verilog mux.v
hierarchy -check -top mux

# sintesis mapeo a formato interno y optimizaciones
proc; opt; techmap; opt; memory; opt

# mappint to internal cell library
techmap; opt

# show preload of my cells
# show

# mapping flip flops to my cells
dfflibmap -liberty mycells.lib

# mapping logic to my cells.lib
abc -liberty mycells.lib

# cleanup
clean

# write synthezised design
write_verilog mux_estructural_real.v

# show diagram
show -lib mycells.v
