# read the verilog file
read_verilog mux_41.v
hierarchy -check -top mux_41

# sintesis mapeo a formato interno y optimizaciones
proc; opt; techmap; opt; memory; opt

# mappint to internal cell library
techmap; opt

# show preload of my cells
# show

# mapping flip flops to my cells
#dfflibmap -liberty mycells.lib

# mapping logic to my cells.lib
#abc -liberty mycells.lib

# cleanup
clean

# write synthezised design
write_verilog mux_41_estructural.v

# show diagram
# show -lib mycells.v
show mux_41
